In [1]:
import pandas as pd

In [4]:
s = pd.Series(data=[1,2,3,4,5,6], index=['a','b','c','c','e','f'])

In [6]:
s[:'c']

a    1
b    2
c    3
c    4
dtype: int64

In [7]:
s[:3]

a    1
b    2
c    3
dtype: int64

In [8]:
ser1 = pd.Series([100,200,300,400], index=['a','b','c','d'])
ser2 = pd.Series([222,333,444,555,666], index=['a','c','d','b','e'])

In [10]:
df = pd.DataFrame({'ser1':ser1,'ser2':ser2})

In [11]:
df

    ser1  ser2
a  100.0   222
b  200.0   555
c  300.0   333
d  400.0   444
e    NaN   666

In [15]:
df[['ser2']]

   ser2
a   222
b   555
c   333
d   444
e   666

In [16]:
df

    ser1  ser2
a  100.0   222
b  200.0   555
c  300.0   333
d  400.0   444
e    NaN   666

In [17]:
df['ser3'] = df.ser2 + 100

In [19]:
df

    ser1  ser2  ser3
a  100.0   222   322
b  200.0   555   655
c  300.0   333   433
d  400.0   444   544
e    NaN   666   766

In [20]:
df['ser3'] = df.ser3 * 2

In [21]:
df

    ser1  ser2  ser3
a  100.0   222   644
b  200.0   555  1310
c  300.0   333   866
d  400.0   444  1088
e    NaN   666  1532